import 'package:spritewidget/spritewidget.dart';

class ChatModel {
  static final List<String> _contents = [
    '不要抱怨${'\n' * 10}抱我',
    '你知道你和星星有什么区别吗?\n星星在天上${'\n' * 5}你在我心里',
    '你最近是不是又胖了?${'\n' * 5}那为什么在我心里的分量越来越重了?',
    '这是我的手背\n这是我的脚背${'\n' * 5}你是我的宝贝',
    '你知道你像什么人吗?${'\n' * 6}我的女人',
    '莫文蔚的阴天\n孙燕姿的雨天\n周杰伦的晴天${'\n' * 5}都不如你和我聊天',
    '面对你\n我不仅善解人意${'\n' * 5}我还善解人衣',
    '我还是喜欢你${'\n' * 5}像小时候吃辣条\n不看日期',
    '我很能干但有一件事不会${'\n' * 3}什么?${'\n' * 5}不会离开你',
    '你今天特别讨厌${'\n' * 5}讨人喜欢和百看不厌',
    '你知道世界上最冷的地方是哪吗?${'\n' * 5}是没有你的地方'
  ];
  static String talk() {
    return _contents[randomInt(_contents.length)];
  }
}
